app/controllers/simulations_controller.rb

SELECT  "simulations".* FROM "simulations" WHERE "simulations"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def success
    @simulation = Simulation.find(params[:id])

INSERT INTO "simulations" ("nome", "nomeEmpresa", "faturamentoMensal", "valorTitulo", "prazoTitulo", "valorTaxa", "valorReceber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @simulation = Simulation.new(simulation_params)

    @simulation.valorTaxa = (@simulation.prazoTitulo / 10) * 1.65
    @simulation.valorReceber = (@simulation.valorTitulo - (@simulation.valorTitulo * (@simulation.valorTaxa/100)))

    if @simulation.save